[
  {
    "title": "Dream Property",
    "about": "The homepage features a navbar, advertisement, user navbar, latest reviews, and a footer, with routes for properties, dashboard, and login. Logged-in users can easily access and interact with properties, add reviews, manage their dashboard, wishlist, and make purchases. Agents add properties, handle user requests, and monitor sold properties. Administrators oversee reviews, user accounts, and property requests, making this project a comprehensive learning experience in web development.",
    "tech": "React, Node js, Express js, Tailwind, Material Ui, Firebase, Jwt",
    "liveUrl": "https://dream-property.netlify.app",
    "github": "https://github.com/mahfuja5768/Dream-property-Client"
  },
  {
    "title": "Vogue-Verse-Apparel",
    "about": "The homepage showcases a banner, navbar, about us, brands, happy customer section, FAQs, and a footer. The navbar facilitates navigation with options like brands, add product, cart, FAQ, register, and user-related features. Brands section displays 6 brand types; clicking a brand card directs users to the brands products page with a slider and selected brand products. Products are presented in cards on the products page, with buttons for details and updates. User interactions like product updates and cart additions prompt login or registration. The my cart page displays added products with a delete option for each.",
    "tech": "React, Tailwind, Firebase",
    "liveUrl": "https://vogue-verse-apparel-client.vercel.app",
    "github": "https://github.com/mahfuja5768/Vogue-Verse-Apparel-Client"
  },
  {
    "title": "Foodie Pal",
    "about": "The homepage features a navbar with Framer Motion, a banner, top foods, and a footer. Users, when logged in, can add, purchase, update, and delete food items via the navbar. The all foods page displays categorized foods, and on the details page, users can order and add items to their added-food section, where they manage purchases, additions, updates, and deletions.",
    "tech": "React, Node js, Express js, Tailwind, Material Ui, Firebase, Jwt",
    "liveUrl": "https://foodie-pal-client.vercel.app",
    "github": "https://github.com/mahfuja5768/Foodipal-client"
  },
  {
    "title": "Mindful-Moments",
    "about": "Mindful Moments, a MERN stack blog website, allows users to seamlessly store, manage, and interact with blog data, offering features like adding, deleting blogs, posting reviews, and creating user accounts, all backed by MongoDB.",
    "tech": " Node.js, JWT , MongoDB, NPM, Router ,React.js, Express.js, , Tailwind, Firebase",
    "liveUrl": "https://mindful-moments-a.netlify.app",
    "github": "https://github.com/mahfuja5768/Mindful-Moments-Client"
  },
  {
    "title": "Music-Amplitudein",
    "about": "The music show ticket counter facilitates ticket purchases, allowing buyers to acquire tickets, while administrators have the capability to add new shows to the platform, enhancing the overall user experience.",
    "tech": " Node.js, JWT , MongoDB, NPM, Router ,React.js, Express.js, , Tailwind, Firebase",
    "liveUrl": "https://music-amplitudein.netlify.app",
    "github": "https://github.com/mahfuja5768/Music-Amplitudein-client/tree/main"
  },
  {
    "title": "Nexcent",
    "about": "This is a HTML CSS landing page. Here I apply only html, css, and javascript. I use javascript for the responsive navbar.",
    "tech": "HTML, CSS, JavaScript",
    "liveUrl": "https://mahfuja5768.github.io/Nexcent",
    "github": "https://github.com/mahfuja5768/Nexcent"
  }
]
